templates/blockMeshDicts/meshOutlet/constant/combustionProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.1.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      combustionProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

//combustionModel  Tatun<rhoChemistryCombustionModel>;
//combustionModel  Tatun<psiChemistryCombustionModel>;
combustionModel  EDM<psiCombustionModel,gasThermoPhysics>


active  on;

"(infinitelyFastChemistryCoeffs|EDMCoeffs)"
{
    C       10.0;
}

TatunCoeffs
{
    Cmix                Cmix [ 0 0 0 0 0 0 0 ] 0.1;
    turbulentReaction   on;
}


// ************************************************************************* //
