templates/blockMeshDicts/meshOutlet/constant/thermo.compressibleGas
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.1.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      thermo.compressibleGas;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

O2
{
    specie	
    {
        nMoles          1;
        molWeight       31.9988;
    }
    thermodynamics
    {
        Tlow            200;
        Thigh           6000;
        Tcommon         1000;
	highCpCoeffs (3.66096065E+00 6.56365811E-04 -1.41149627E-07 2.05797935E-11 -1.29913436E-15 -1.21597718E+03 3.41536279E+00);
	lowCpCoeffs (3.78245636E+00 -2.99673416E-03 9.84730201E-06 -9.68129509E-09 3.24372837E-12 -1.06394356E+03 3.65767573E+00);
        //highCpCoeffs    ( 3.69758 0.00061352 -1.25884e-07 1.77528e-11 -1.13644e-15 -1233.93 3.18917 );
        //lowCpCoeffs     ( 3.21294 0.00112749 -5.75615e-07 1.31388e-09 -8.76855e-13 -1005.25 6.03474 );
    }
    transport	
    {
        As              1.67212e-06;
        Ts              170.672;
    }

/*O2                121386O   2               G  0200.00   5000.00  1000.00      1
 0.03697578E+02 0.06135197E-02-0.01258842E-05 0.01775281E-09-0.01136435E-13    2
-0.01233930E+05 0.03189166E+02 0.03212936E+02 0.01127486E-01-0.05756150E-05    3
 0.01313877E-07-0.08768554E-11-0.01005249E+05 0.06034738E+02   */
}

H2O
{
    specie
    {
        nMoles          1;
        molWeight       18.0153;
    }
    thermodynamics
    {
        Tlow            200;
        Thigh           6000;
        Tcommon         1000;
        highCpCoeffs    (0.26770389E+01 0.29731816E-02 -0.77376889E-06 0.94433514E-10 -0.42689991E-14 -0.29885894E+05 0.68825500E+01);
        lowCpCoeffs     (0.41986352E+01 -0.20364017E-02 0.65203416E-05 -0.54879269E-08 0.17719680E-11 -0.30293726E+05 -0.84900901E+00);
        //highCpCoeffs    ( 2.67215 0.00305629 -8.73026e-07 1.201e-10 -6.39162e-15 -29899.2 6.86282 );
        //lowCpCoeffs     ( 3.38684 0.00347498 -6.3547e-06 6.96858e-09 -2.50659e-12 -30208.1 2.59023 );
    }
    transport
    {
        As              1.67212e-06;
        Ts              170.672;
    }
}

CH4
{
    specie
    {
        nMoles          1;
        molWeight       16.0428;
    }
    thermodynamics
    {
        Tlow            200;
        Thigh           6000;
        Tcommon         1000;
        highCpCoeffs    ( 1.63543 0.0100844 -3.36924e-06 5.34973e-10 -3.15528e-14 -10005.6 9.9937 );
        lowCpCoeffs     ( 5.14988 -0.013671 4.91801e-05 -4.84744e-08 1.66694e-11 -10246.6 -4.64132 );
    }
    transport
    {
        As              1.67212e-06;
        Ts              170.672;
    }
/*
CH4       29/11/04      H   4C   1    0    0G   200.000  5000.000 1462.000     1
 4.09617653E+00 7.44330845E-03-2.63871900E-06 4.19577604E-10-2.47508050E-14    2
-1.13835704E+04-4.67561383E+00 3.72113020E+00-2.50293289E-03 1.90246534E-05    3
-1.46871253E-08 3.43791152E-12-1.01424099E+04 1.22776596E+00                   4
*/
}

CO2
{
    specie
    {
        nMoles          1;
        molWeight       44.01;
    }
    thermodynamics
    {
        Tlow            200;
        Thigh           6000;
        Tcommon         1000;
        highCpCoeffs    (0.46365111E+01 0.27414569E-02 -0.99589759E-06 0.16038666E-09 -0.91619857E-14 -0.49024904E+05 -0.19348955E+01 );
        lowCpCoeffs     (0.23568130E+01 0.89841299E-02 -0.71220632E-05 0.24573008E-08 -0.14288548E-12 -0.48371971E+05 0.99009035E+01);
        //highCpCoeffs    ( 4.45362 0.00314017 -1.27841e-06 2.394e-10 -1.66903e-14 -48967 -0.955396 );
        //lowCpCoeffs     ( 2.27572 0.00992207 -1.04091e-05 6.86669e-09 -2.11728e-12 -48373.1 10.1885 );
    }
    transport
    {
        As              1.67212e-06;
        Ts              170.672;
    }
}

N2
{
    specie
    {
        nMoles          1;
        molWeight       28.0134;
    }
    thermodynamics
    {
        Tlow            200;
        Thigh           5000;
        Tcommon         1000;
        highCpCoeffs    ( 2.92664 0.00148798 -5.68476e-07 1.0097e-10 -6.75335e-15 -922.798 5.98053 );
        lowCpCoeffs     ( 3.29868 0.00140824 -3.96322e-06 5.64152e-09 -2.44486e-12 -1020.9 3.95037 );
    }
    transport
    {
        As              1.67212e-06;
        Ts              170.672;
    }
}

C3H6
{
    specie
    {
        nMoles          1;
        molWeight       42.08;
    }
    thermodynamics
    {
        Tlow            200;
        Thigh           6000;
        Tcommon         1000;
	highCpCoeffs    (6.03870234E+00 1.62963931E-02 -5.82130800E-06 9.35936829E-10 -5.58603143E-14 -7.41715057E+02 -8.43825992E+00);
        lowCpCoeffs     (3.83464468E+00 3.29078952E-03 5.05228001E-05 -6.66251176E-08 2.63707473E-11 7.88717123E+02 7.53408013E+00);
//	highCpCoeffs    ( 8.01595958e+00 1.37023634e-02 -4.66249733e-06 7.21254402E-10 -4.17370126e-14 -1.76749303e+03 -2.00160668e+01);
//        lowCpCoeffs     ( 3.94615444e-01 2.89107662e-02 -1.54886808e-05 3.88814209E-09 -3.37890352E-13 1.17760132E+03 2.19003736E+01 );
//        highCpCoeffs    ( 2.92664 0.00148798 -5.68476e-07 1.0097e-10 -6.75335e-15 -922.798 5.98053 );
//        lowCpCoeffs     ( 3.29868 0.00140824 -3.96322e-06 5.64152e-09 -2.44486e-12 -1020.9 3.95037 );
    }
    transport
    {
        As              1.67212e-06;
        Ts              170.672;
    }
}
/*
C3H6      10/23/ 5 THERMC   3H   6    0    0G   200.000  5000.000 1388.000     1
 8.01595958E+00 1.37023634E-02-4.66249733E-06 7.21254402E-10-4.17370126E-14    2
-1.76749303E+03-2.00160668E+01 3.94615444E-01 2.89107662E-02-1.54886808E-05    3
 3.88814209E-09-3.37890352E-13 1.17760132E+03 2.19003736E+01  



N2                121286N   2               G  0200.00   5000.00  1000.00      1
 0.02926640E+02 0.01487977E-01-0.05684761E-05 0.01009704E-08-0.06753351E-13    2
-0.09227977E+04 0.05980528E+02 0.03298677E+02 0.01408240E-01-0.03963222E-04    3
 0.05641515E-07-0.02444855E-10-0.01020900E+05 0.03950372E+02   
*/
H
{
    specie
    {
        nMoles          1;
        molWeight       1.008;
    }
    thermodynamics
    {
        Tlow            200;
        Thigh           6000;
        Tcommon         1000;
	highCpCoeffs    (0.25000000E+01 0.00000000E+00 0.00000000E+00 0.00000000E+00 0.00000000E+00 0.25473660E+05 -0.44668285E+00);
        lowCpCoeffs     (0.25000000E+01 0.00000000E+00 0.00000000E+00 0.00000000E+00 0.00000000E+00 0.25473660E+05 -0.44668285E+00);
	//highCpCoeffs    (0.02500000E+02 0.00000000E+00 0.00000000E+00 0.00000000E+00 0.00000000E+00 0.02547163E+06 -0.04601176E+01);
        //lowCpCoeffs     (0.02500000E+02 0.00000000E+00 0.00000000E+00 0.00000000E+00 0.00000000E+00 0.02547163E+06 -0.04601176E+01);
//        highCpCoeffs    ( 2.92664 0.00148798 -5.68476e-07 1.0097e-10 -6.75335e-15 -922.798 5.98053 );
//        lowCpCoeffs     ( 3.29868 0.00140824 -3.96322e-06 5.64152e-09 -2.44486e-12 -1020.9 3.95037 );
    }
    transport
    {
        As              1.67212e-06;
        Ts              170.672;
    }
}
/*
H                 120186H   1               G  0200.00   5000.00  1000.00      1
 0.02500000E+02 0.00000000E+00 0.00000000E+00 0.00000000E+00 0.00000000E+00    2
 0.02547163E+06-0.04601176E+01 0.02500000E+02 0.00000000E+00 0.00000000E+00    3
 0.00000000E+00 0.00000000E+00 0.02547163E+06-0.04601176E+01                   4
*/
O
{
    specie
    {
        nMoles          1;
        molWeight       15.999;
    }
    thermodynamics
    {
        Tlow            200;
        Thigh           6000;
        Tcommon         1000;
	highCpCoeffs    (2.54363697E+00 -2.73162486E-05 -4.19029520E-09 4.95481845E-12 -4.79553694E-16 2.92260120E+04 4.92229457E+00);
        lowCpCoeffs     (3.16826710E+00 -3.27931884E-03 6.64306396E-06 -6.12806624E-09 2.11265971E-12 2.91222592E+04 2.05193346E+00);
	//highCpCoeffs    (0.02542060E+02 -0.02755062E-03 -0.03102803E-07 0.04551067E-10 -0.04368052E-14 0.02923080E+06 0.04920308E+02);
        //lowCpCoeffs     (0.02946429E+02 -0.01638166E-01 0.02421032E-04 -0.01602843E-07 0.03890696E-11 0.02914764E+06 0.02963995E+02);
//        highCpCoeffs    ( 2.92664 0.00148798 -5.68476e-07 1.0097e-10 -6.75335e-15 -922.798 5.98053 );
//        lowCpCoeffs     ( 3.29868 0.00140824 -3.96322e-06 5.64152e-09 -2.44486e-12 -1020.9 3.95037 );
    }
    transport
    {
        As              1.67212e-06;
        Ts              170.672;
    }
}
/*
O                 120186O   1               G  0200.00   5000.00  1000.00      1
 0.02542060E+02-0.02755062E-03-0.03102803E-07 0.04551067E-10-0.04368052E-14    2
 0.02923080E+06 0.04920308E+02 0.02946429E+02-0.01638166E-01 0.02421032E-04    3
-0.01602843E-07 0.03890696E-11 0.02914764E+06 0.02963995E+02                   4
*/
OH
{
    specie
    {
        nMoles          1;
        molWeight       17.01;
    }
    thermodynamics
    {
        Tlow            200;
        Thigh           5000;
        Tcommon         1710;
	highCpCoeffs    (2.85376040E+00 1.02994334E-03 -2.32666477E-07 1.93750704E-11 -3.15759847E-16 3.69949720E+03 5.78756825E+00);
        lowCpCoeffs     (3.41896226E+00 3.19255801E-04 -3.08292717E-07 3.64407494E-10 -1.00195479E-13 3.45264448E+03 2.54433372E+00);
//        highCpCoeffs    ( 2.92664 0.00148798 -5.68476e-07 1.0097e-10 -6.75335e-15 -922.798 5.98053 );
//        lowCpCoeffs     ( 3.29868 0.00140824 -3.96322e-06 5.64152e-09 -2.44486e-12 -1020.9 3.95037 );
    }
    transport
    {
        As              1.67212e-06;
        Ts              170.672;
    }
}

/*
OH         7/13/ 0 RUCICH   1O   1    0    0G   200.000  5000.000 1710.000     1
 2.85376040E+00 1.02994334E-03-2.32666477E-07 1.93750704E-11-3.15759847E-16    2
 3.69949720E+03 5.78756825E+00 3.41896226E+00 3.19255801E-04-3.08292717E-07    3
 3.64407494E-10-1.00195479E-13 3.45264448E+03 2.54433372E+00                   4
*/
CO
{
    specie
    {
        nMoles          1;
        molWeight       28.01;
    }
    thermodynamics
    {
        Tlow            200;
        Thigh           6000;
        Tcommon         1000;
	highCpCoeffs    (0.30484859E+01 0.13517281E-02 -0.48579405E-06 0.78853644E-10 -0.46980746E-14 -0.14266117E+05 0.60170977E+01);
        lowCpCoeffs     (0.35795335E+01 -0.61035369E-03 0.10168143E-05 0.90700586E-09 -0.90442449E-12 -0.14344086E+05 0.35084093E+01);
//	highCpCoeffs    (3.11216890E+00 1.15948283E-03 -3.38480362E-07 4.41403098E-11 -2.12862228E-15 -1.42718539E+04 5.71725177E+00);
//        lowCpCoeffs     (3.19036352E+00 8.94419972E-04 -3.24927563E-08 -1.04599967E-10 2.41965693E-14 -1.42869054E+04 5.33277914E+00);
//        highCpCoeffs    ( 2.92664 0.00148798 -5.68476e-07 1.0097e-10 -6.75335e-15 -922.798 5.98053 );
//        lowCpCoeffs     ( 3.29868 0.00140824 -3.96322e-06 5.64152e-09 -2.44486e-12 -1020.9 3.95037 );
    }
    transport
    {
        As              1.67212e-06;
        Ts              170.672;
    }
}
/*
CO        29/11/04      C   1O   1    0    0G   200.000  5000.000 1429.000     1
 3.11216890E+00 1.15948283E-03-3.38480362E-07 4.41403098E-11-2.12862228E-15    2
-1.42718539E+04 5.71725177E+00 3.19036352E+00 8.94419972E-04-3.24927563E-08    3
-1.04599967E-10 2.41965693E-14-1.42869054E+04 5.33277914E+00                   4
*/

H2
{
    specie
    {
        nMoles          1;
        molWeight       2.016;
    }
    thermodynamics
    {
        Tlow            200;
        Thigh           6000;
        Tcommon         1000;
        highCpCoeffs    (2.93286575E+00 8.26608026E-04 -1.46402364E-07 1.54100414E-11 -6.88804800E-16 -8.13065581E+02 -1.02432865E+00);
        lowCpCoeffs     (2.34433112E+00 7.98052075E-03 -1.94781510E-05 2.01572094E-08 -7.37611761E-12 -9.17935173E+02 6.83010238E-01);
        //highCpCoeffs    ( 0.02991423e+02 0.07000644e-02 -0.05633829e-06 -0.09231578e-10 0.01582752e-13 -0.08350340e+04 -0.01355110e+02 );
        //lowCpCoeffs     ( 0.03298124e+02 0.08249442e-02 -0.08143015e-05 -0.09475434e-09 0.04134872e-11 -0.01012521e+05 -0.03294094e+02 );
    }
    transport
    {
        As              1.67212e-06;
        Ts              170.672;
    }
}
// ************************************************************************* //
