templates/blockMeshDicts/meshOutlet/constant/thermophysicalProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.1.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      thermophysicalProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

//thermoType hsRhoMixtureThermo<reactingMixture<gasThermoPhysics>>;
//thermoType hsPsiMixtureThermo<reactingMixture<gasThermoPhysics>>;
thermoType hsPsiMixtureThermo<singleStepReactingMixture<gasThermoPhysics>>;



//thermoType      hsPsiMixtureThermo<sutherlandTransport<specieThermo<janafThermo<perfectGas>>>>;
//thermoType	hsPsiThermo<pureMixture<sutherlandTransport<specieThermo<janafThermo<perfectGas>>>>>;
mixture
{
	transport
	{
		Pr	0.72;
	}
}

//thermoType hsRhoThermo<pureMixture<sutherlandTransport<specieThermo<janafThermo<perfectGas>>>>>;

mixture
{
    specie
    {
        nMoles          1;
        molWeight       28.0134;
    }
    thermodynamics
    {
        Tlow            200;
        Thigh           5000;
        Tcommon         1000;
        highCpCoeffs    ( 2.92664 0.00148798 -5.68476e-07 1.0097e-10 -6.75335e-15 -922.798 5.98053 );
        lowCpCoeffs     ( 3.29868 0.00140824 -3.96322e-06 5.64152e-09 -2.44486e-12 -1020.9 3.95037 );
    }
    transport
    {
        As              1.67212e-06;
        Ts              170.672;
    }
    
    specie
    {
        nMoles          1;
        molWeight       28.0134;
    }
    thermodynamics
    {
        Tlow            200;
        Thigh           5000;
        Tcommon         1000;
        highCpCoeffs    ( 2.92664 0.00148798 -5.68476e-07 1.0097e-10 -6.75335e-15 -922.798 5.98053 );
        lowCpCoeffs     ( 3.29868 0.00140824 -3.96322e-06 5.64152e-09 -2.44486e-12 -1020.9 3.95037 );
    }
    transport
    {
        As              1.67212e-06;
        Ts              170.672;
	Pr              0.72;
    }
}//

fuel C3H6;

inertSpecie N2;

chemistryReader foamChemistryReader;

//foamChemistryFile "$FOAM_CASE/constant/reactions";
foamChemistryFile "$FOAM_TEMPS/reactions/dissociatedC3H6woO2";

//foamChemistryThermoFile "$FOAM_TEMPS/thermo.compressibleGas";
foamChemistryThermoFile "$FOAM_TEMPS/thermo.compressibleGas_new";


// ************************************************************************* //
