templates/blockMeshDicts/meshOutlet/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.1.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    cooler
    {
//	type zeroGradient; /*
	type flowRateInletVelocity;
	flowRate 8.0324e-7;//0.10558e-4;//0.10558e-4; // Volumetric/mass flow rate [m3/s or kg/s]
	value uniform (0 0 0); // placeholder*/
    }
    fuelAir
    {
//	type zeroGradient; /*
	type flowRateInletVelocity;
	flowRate 8.3915e-7;//0.18396e-4;//0.108396e-4;//0.18396e-4; // Volumetric/mass flow rate [m3/s or kg/s]
	value uniform (0 0 0); // placeholder*/
    }
    carrier
    {
//	type zeroGradient; /*
	type flowRateInletVelocity;
	flowRate 2.5866e-8;//0.0045599e-4; // Volumetric/mass flow rate [m3/s or kg/s]
	value uniform (0 0 0); // placeholder*/
    }
    walls
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
    midWalls
    {
	    type	slip;
    }
    symmetric
    {
        type            symmetryPlane;
    }
    front
    {
        type            empty;
    }
    back
    {
        type            empty;
    }
    outlet
    {
	type		pressureInletOutletVelocity;
	value		uniform (0 0 0);
    }
    frontAndBack_pos
    {
        type            wedge;
    }
    frontAndBack_neg
    {
        type            wedge;
    }
    divOutlet
    {
	    type slip;
    }
    outsideInlet
    {
	    type slip;
    }
}


// ************************************************************************* //
