templates/blockMeshDicts/meshOutlet/0/C3H6
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.1.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      CH4;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    cooler
    {
        type            fixedValue;
        value           uniform 0;
    }
    fuelAir
    {
        type            fixedValue;
        value           uniform 0.2859;//0.2299; // 0.1135/(0.1135 + 0.3903)
    }
    carrier
    {
        type            fixedValue;
        value           uniform 0;
    }
    walls
    {
        type            zeroGradient;
    }
    midWalls
    {
	type		slip;
    }
    symmetric
    {
        type            symmetryPlane;
    }
    front
    {
        type            empty;
    }
    back
    {
        type            empty;
    }
    outlet
    {
        type            inletOutlet;
        inletValue      uniform 0;
        value           uniform 0;
    }
    frontAndBack_pos
    {
        type            wedge;
    }
    frontAndBack_neg
    {
        type            wedge;
    }
    divOutlet
    {
	    type slip;
    }
    outsideInlet
    {
	    type slip;
    }
}


// ************************************************************************* //
