templates/blockMeshDicts/meshOutlet/system/topoSetDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.1.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      setFieldsDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

actions
(
  {
    name    selectedCells;
    type    cellSet;
    action  new;
    source  boxToCell;
    sourceInfo
    {
      box (0.0627 0.0 -1) (0.16 0.0362 1); // diverging part begins at x = 61.95 mm
    }
  }
  /*{
    name    selectedFaces;
    type    faceSet;
    action  new;
    source  patchToFace;
    sourceInfo
    {
      name bottomWall;
    }
  }*/
);

// ************************************************************************* //
